In [1]:
import numpy as np
import pandas as pd

In [5]:
df = pd.DataFrame({'A': list('bbacab'), 'B': np.arange(5, 11)})

In [8]:
pd.crosstab(df['A'], df['B'])

B  5   6   7   8   9   10
A
a   0   0   1   0   1   0
b   1   1   0   0   0   1
c   0   0   0   1   0   0

In [22]:
df = pd.DataFrame({'A': ['a', 'b', 'c'], 'B': ['c', 'c', 'b'], 'C': [1,2,3]})

In [11]:
pd.get_dummies(df, prefix='New_prefix')

   C  New_prefix_a  New_prefix_b  New_prefix_c  New_prefix_b  New_prefix_c
0  1             1             0             0             0             1
1  2             0             1             0             0             1
2  3             0             0             1             1             0

In [12]:
pd.get_dummies(df, prefix=['From_A', 'From_B'])

   C  From_A_a  From_A_b  From_A_c  From_B_b  From_B_c
0  1         1         0         0         0         1
1  2         0         1         0         0         1
2  3         0         0         1         1         0

In [13]:
pd.get_dummies(df, prefix={'A': 'from_A', 'B': 'from_B'})

   C  from_A_a  from_A_b  from_A_c  from_B_b  from_B_c
0  1         1         0         0         0         1
1  2         0         1         0         0         1
2  3         0         0         1         1         0

In [14]:
pd.get_dummies(df, prefix=['from_A', 'from_B'], prefix_sep='*')

   C  from_A*a  from_A*b  from_A*c  from_B*b  from_B*c
0  1         1         0         0         0         1
1  2         0         1         0         0         1
2  3         0         0         1         1         0

In [15]:
pd.get_dummies(df, columns=['A'])

   B  C  A_a  A_b  A_c
0  c  1    1    0    0
1  c  2    0    1    0
2  b  3    0    0    1

In [18]:
pd.get_dummies(df, prefix=['from_A', 'from_B'], drop_first=True)

   C  from_A_b  from_A_c  from_B_c
0  1         0         0         1
1  2         1         0         1
2  3         0         1         0

In [28]:
df1 = pd.DataFrame({'A': ['d', 'e', 'f'], 'B': ['g', 'h', 'e'], 'C': [1,2,3]})
df1

   A  B  C
0  d  g  1
1  e  h  2
2  f  e  3

In [29]:
pd.get_dummies(df1, drop_first=True)

   C  A_e  A_f  B_g  B_h
0  1    0    0    1    0
1  2    1    0    0    1
2  3    0    1    0    0

In [30]:
pd.get_dummies(df1)

   C  A_d  A_e  A_f  B_e  B_g  B_h
0  1    1    0    0    0    1    0
1  2    0    1    0    0    0    1
2  3    0    0    1    1    0    0

In [32]:
np.random.seed([3, 1415])
n = 20

In [62]:
df = pd.DataFrame((np.random.randint(5, size=(n,4)) // [2,1,2,1]).astype(str))

In [60]:
cols.dtype

dtype('<U4')

In [65]:
(cols + df).head()

      0     1      2     3
0  key1  row1  item1  col0
1  key0  row2  item0  col3
2  key1  row1  item1  col4
3  key0  row0  item0  col1
4  key0  row0  item0  col4

In [66]:
cols = np.array(['key', 'row', 'item', 'col'])
(cols + pd.DataFrame((np.random.randint(5, size=(n,4)) // [2,1,2,1]).astype(str))).head()

      0     1      2     3
0  key1  row3  item0  col3
1  key0  row0  item2  col4
2  key1  row2  item2  col1
3  key0  row0  item0  col3
4  key0  row4  item0  col2

In [84]:
np.random.seed([3, 1415])
n = 20
cols = np.array(['key', 'row', 'item', 'col'])
df = cols + pd.DataFrame((np.random.randint(5, size=(n,4)) // [2,1,2,1]).astype(str))
df.columns = cols
df = df.join(pd.DataFrame(np.random.randn(n, 2).round(2)).add_prefix('val'))

In [85]:
df.head()

    key   row   item   col  val0  val1
0  key0  row3  item1  col3 -0.73 -0.10
1  key1  row2  item1  col2  0.27 -1.11
2  key1  row0  item1  col0  0.50  1.13
3  key0  row4  item0  col2 -0.26  0.92
4  key1  row0  item2  col1  1.14 -1.63

In [86]:
# pd.DataFrame(np.random.randn(8, 4).round(2).astype(str)) + np.array(['A', 'B', 'C', 'D'])

In [90]:
df.pivot_table(index='row', columns='col', values='val0', aggfunc=np.mean)

col   col0  col1  col2   col3  col4
row
row0  0.50  0.04   NaN -0.420 -0.24
row2 -0.31   NaN -0.16 -0.150  0.39
row3   NaN  1.50   NaN  0.380   NaN
row4   NaN -2.91 -0.72 -0.915  1.43

In [91]:
df.pivot_table(index='row', columns='col', fill_value=0, aggfunc='size')

col   col0  col1  col2  col3  col4
row
row0     1     2     0     1     1
row2     1     0     2     1     2
row3     0     1     0     2     0
row4     0     1     2     2     1

In [92]:
df.query('row=="row0" and col=="col1"')

     key   row   item   col  val0  val1
4   key1  row0  item2  col1  1.14 -1.63
10  key2  row0  item2  col1 -1.06 -0.72

In [98]:
pd.crosstab(df['row'], df['col'])

col   col0  col1  col2  col3  col4
row
row0     1     2     0     1     1
row2     1     0     2     1     2
row3     0     1     0     2     0
row4     0     1     2     2     1

In [105]:
df.pivot_table(index='row', columns='col', aggfunc=['sum', 'mean'])

       sum                                                        mean        \
      val0                          val1                          val0
col   col0  col1  col2  col3  col4  col0  col1  col2  col3  col4  col0  col1
row
row0  0.50  0.08   NaN -0.42 -0.24  1.13 -2.35   NaN  2.23 -1.60  0.50  0.04
row2 -0.31   NaN -0.32 -0.15  0.78  0.16   NaN -1.44 -1.07 -2.21 -0.31   NaN
row3   NaN  1.50   NaN  0.76   NaN   NaN -1.11   NaN  0.23   NaN   NaN  1.50
row4   NaN -2.91 -1.44 -1.83  1.43   NaN  0.18  1.48  1.91 -0.96   NaN -2.91


                         val1
col   col2   col3  col4  col0   col1  col2   col3   col4
row
row0   NaN -0.420 -0.24  1.13 -1.175   NaN  2.230 -1.600
row2 -0.16 -0.150  0.39  0.16    NaN -0.72 -1.070 -1.105
row3   NaN  0.380   NaN   NaN -1.110   NaN  0.115    NaN
row4 -0.72 -0.915  1.43   NaN  0.180  0.74  0.955 -0.960

In [137]:
keys = ['panda1', 'panda2', 'panda3']
values = [['eats', 'shots'], ['shoots', 'leave'], ['eats', 'leaves']]
df1 = pd.DataFrame({'key': keys, 'values': values})
# df1['values'].explode()
df1.explode('values')

      key  values
0  panda1    eats
0  panda1   shots
1  panda2  shoots
1  panda2   leave
2  panda3    eats
2  panda3  leaves

In [113]:
df = pd.DataFrame([{'var1': "a,b,c", 'var2':1}, {'var3': 'd,e,f', 'var4': 2}])
df

    var1  var2   var3  var4
0  a,b,c   1.0    NaN   NaN
1    NaN   NaN  d,e,f   2.0

In [121]:
df['var1'].str.replace(',', '')

0    abc
1    NaN
Name: var1, dtype: object

In [146]:
df = df.assign(var1=df['var1'].str.split(','), var3=df['var3'].str.split(',')).explode('var1')

In [147]:
df = df.explode('var3')

In [148]:
df

  var1  var2 var3  var4
0    a   1.0  NaN   NaN
0    b   1.0  NaN   NaN
0    c   1.0  NaN   NaN
1  NaN   NaN    d   2.0
1  NaN   NaN    e   2.0
1  NaN   NaN    f   2.0

In [149]:
pd.Series(['a', 'b', 'c'])

0    a
1    b
2    c
dtype: object

In [154]:
pd.Series(['a', 'b', 'c']).astype(pd.StringDtype())

0    a
1    b
2    c
dtype: string

In [161]:
df = pd.DataFrame(np.random.randn(3,2), columns=[' Column A ', ' Column B '], index=range(3))
df

    Column A    Column B
0    0.395862    0.916287
1    0.587947   -0.779254
2   -1.016753   -1.256779

In [162]:
df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_')
df

   column_a  column_b
0  0.395862  0.916287
1  0.587947 -0.779254
2 -1.016753 -1.256779

In [165]:
s2 = pd.Series(['a_b_c', 'c_d_e', np.nan, 'f_g_h'], dtype='string')
s2

0    a_b_c
1    c_d_e
2     <NA>
3    f_g_h
dtype: string

In [168]:
s2.str.split('_', expand=True)

      0     1     2
0     a     b     c
1     c     d     e
2  <NA>  <NA>  <NA>
3     f     g     h

In [169]:
pd.Series(['bat bar']).str.swapcase()

0    BAT BAR
dtype: object

In [172]:
s = pd.Series(['a', 'b', 'c', 'd'], dtype='string')
u = pd.Series(['e', 'f', 'g', 'g'], index=[3, 1, 2, 0], dtype='string')

In [179]:
s.str.cat(u, join='right').sort_index()

0    ag
1    bf
2    cg
3    de
dtype: string

In [180]:
u.to_numpy()

array(['e', 'f', 'g', 'g'], dtype=object)

In [181]:
s.str.cat([u, u.to_numpy()])

0    age
1    bff
2    cgg
3    deg
dtype: string

In [185]:
u.loc[[3]]

3    e
dtype: string

In [186]:
import plotly.express as px

In [188]:
df = px.data.iris()
df.head()

   sepal_length  sepal_width  petal_length  petal_width species  species_id
0           5.1          3.5           1.4          0.2  setosa           1
1           4.9          3.0           1.4          0.2  setosa           1
2           4.7          3.2           1.3          0.2  setosa           1
3           4.6          3.1           1.5          0.2  setosa           1
4           5.0          3.6           1.4          0.2  setosa           1

In [193]:
df.loc[[3]]

   sepal_length  sepal_width  petal_length  petal_width species  species_id
3           4.6          3.1           1.5          0.2  setosa           1

In [194]:
v = pd.Series(['z', 'a', 'b', 'd', 'e'], index=[-1, 0, 1, 3, 4], dtype='string')

In [198]:
v

-1    z
 0    a
 1    b
 3    d
 4    e
dtype: string

In [199]:
u.loc[0]
# v.loc[[3, 4]]

'g'

In [200]:
s.str.cat([u.loc[[0]], v.loc[[3, 4]]], join='right', na_rep='-')

0    ag-
3    d-d
4    --e
dtype: string

In [205]:
type(u.loc[0])

str

In [206]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'], dtype='string')
s

0       A
1       B
2       C
3    Aaba
4    Baca
5    <NA>
6    CABA
7     dog
8     cat
dtype: string

In [233]:
s.str[0]

0       A
1       B
2       C
3       A
4       B
5    <NA>
6       C
7       d
8       c
dtype: string

In [228]:
pd.Series(['a1', 'b2', 'c3'], dtype='string').str.extract(r'([ab])(\d)', expand=False)

      0     1
0     a     1
1     b     2
2  <NA>  <NA>

In [229]:
pd.Series(['a1', 'b2', 'c3'], dtype='string').str.extract(r'([ab])(\d)', expand=True)

      0     1
0     a     1
1     b     2
2  <NA>  <NA>

In [237]:
s = pd.Series(['a1', 'b2', 'c3'], ['A11', 'B22', 'C33'], dtype='string', name='one')
s.index

Index(['A11', 'B22', 'C33'], dtype='object')

In [238]:
s = pd.Series(['a1', 'b2', 'c3'], ['A11', 'B22', 'C33'], dtype='string')

In [242]:
s.index.str.extract('(?P<letter>[a-zA-Z])([0-9]+)', expand=True)

  letter   1
0      A  11
1      B  22
2      C  33

In [247]:
table = pd.read_html('https://pandas.pydata.org/docs/user_guide/text.html')

In [252]:
print(table[0].to_html(index=False))

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th>0</th>
      <th>1</th>
      <th>2</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>NaN</td>
      <td>1 group</td>
      <td>&gt;1 group</td>
    </tr>
    <tr>
      <td>Index</td>
      <td>Index</td>
      <td>ValueError</td>
    </tr>
    <tr>
      <td>Series</td>
      <td>Series</td>
      <td>DataFrame</td>
    </tr>
  </tbody>
</table>

In [253]:
pattern = '[0-9][a-z]'
pd.Series(['1', '2', '3a', '3b', '03c', '4dx'], dtype='string').str.contains(pattern)

0    False
1    False
2     True
3     True
4     True
5     True
dtype: boolean